lkolbly/cmsis-svd/data/TexasInstruments/LM3S102.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="TIMER0">
      <name>TIMER1</name>
      <prependToName>TIMER1</prependToName>
      <baseAddress>0x40031000</baseAddress>
    </peripheral>
    <peripheral>
      <name>COMP</name>
      <description>Register map for COMP peripheral</description>
      <groupName>COMP</groupName>
      <prependToName>COMP</prependToName>
      <baseAddress>0x4003C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ACMIS</name>
          <description>Analog Comparator Masked Interrupt Status</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>COMP_ACMIS_IN0</name>
              <description>Comparator 0 Masked Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACRIS</name>
          <description>Analog Comparator Raw Interrupt Status</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>COMP_ACRIS_IN0</name>
              <description>Comparator 0 Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACINTEN</name>
          <description>Analog Comparator Interrupt Enable</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>COMP_ACINTEN_IN0</name>
              <description>Comparator 0 Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACREFCTL</name>
          <description>Analog Comparator Reference Voltage Control</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>COMP_ACREFCTL_VREF</name>
              <description>Resistor Ladder Voltage Ref</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>COMP_ACREFCTL_RNG</name>
              <description>Resistor Ladder Range</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>COMP_ACREFCTL_EN</name>
              <description>Resistor Ladder Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACSTAT0</name>
          <description>Analog Comparator Status 0</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>COMP_ACSTAT0_OVAL</name>
              <description>Comparator Output Value</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCTL0</name>
          <description>Analog Comparator Control 0</description>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>COMP_ACCTL0_CINV</name>
              <description>Comparator Output Invert</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>COMP_ACCTL0_ISEN</name>
              <description>Interrupt Sense</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ISEN_LEVEL</name>
                  <description>Level sense, see ISLVAL</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ISEN_FALL</name>
                  <description>Falling edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ISEN_RISE</name>
                  <description>Rising edge</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ISEN_BOTH</name>
                  <description>Either edge</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_ACCTL0_ISLVAL</name>
              <description>Interrupt Sense Level Value</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>COMP_ACCTL0_ASRCP</name>
              <description>Analog Source Positive</description>
              <bitRange>[10:9]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ASRCP_PIN</name>
                  <description>Pin value of Cn+</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ASRCP_PIN0</name>
                  <description>Pin value of C0+</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ASRCP_REF</name>
                  <description>Internal voltage reference (VIREF)</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>FLASH_CTRL</name>
      <description>Register map for FLASH_CTRL peripheral</description>
      <groupName>FLASH_CTRL</groupName>
      <prependToName>FLASH_CTRL</prependToName>
      <baseAddress>0x400FD000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>FMA</name>
          <description>Flash Memory Address</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>FLASH_FMA_OFFSET</name>
              <description>Address Offset</description>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FMD</name>
          <description>Flash Memory Data</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>FLASH_FMD_DATA</name>
              <description>Data Value</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC</name>
          <description>Flash Memory Control</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>FLASH_FMC_WRITE</name>
              <description>Write a Word into Flash Memory</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLASH_FMC_ERASE</name>
              <description>Erase a Page of Flash Memory</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>FLASH_FMC_MERASE</name>
              <description>Mass Erase Flash Memory</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>FLASH_FMC_COMT</name>
              <description>Commit Register Value</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>FLASH_FMC_WRKEY</name>
              <description>FLASH write key</description>
              <bitRange>[31:17]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FCRIS</name>
          <description>Flash Controller Raw Interrupt Status</description>
          <addressOffset>0x0000000C</addressOffset>
          <fields>
            <field>
              <name>FLASH_FCRIS_ARIS</name>
              <description>Access Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLASH_FCRIS_PRIS</name>
              <description>Programming Raw Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FCIM</name>
          <description>Flash Controller Interrupt Mask</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>FLASH_FCIM_AMASK</name>
              <description>Access Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLASH_FCIM_PMASK</name>
              <description>Programming Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FCMISC</name>
          <description>Flash Controller Masked Interrupt Status and Clear</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>FLASH_FCMISC_AMISC</name>
              <description>Access Masked Interrupt Status and Clear</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLASH_FCMISC_PMISC</name>
              <description>Programming Masked Interrupt Status and Clear</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FMPRE</name>
          <description>Flash Memory Protection Read Enable</description>
          <addressOffset>0x00001130</addressOffset>
        </register>
        <register>
          <name>FMPPE</name>
          <description>Flash Memory Protection Program Enable</description>
          <addressOffset>0x00001134</addressOffset>
        </register>
        <register>
          <name>USECRL</name>
          <description>USec Reload</description>
          <addressOffset>0x00001140</addressOffset>
          <fields>
            <field>
              <name>FLASH_USECRL</name>
              <description>Microsecond Reload Value</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
