lkolbly/cmsis-svd/data/TexasInstruments/LM3S102.svd
        <register>
          <name>MISC</name>
          <description>Masked Interrupt Status and Clear</description>
          <addressOffset>0x00000058</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_MISC_BORMIS</name>
              <description>BOR Masked Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_MISC_LDOMIS</name>
              <description>LDO Power Unregulated Masked Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_MISC_MOFMIS</name>
              <description>Main Oscillator Fault Masked Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_MISC_IOFMIS</name>
              <description>Internal Oscillator Fault Masked Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_MISC_CLMIS</name>
              <description>Current Limit Masked Interrupt Status</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_MISC_PLLLMIS</name>
              <description>PLL Lock Masked Interrupt Status</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RESC</name>
          <description>Reset Cause</description>
          <addressOffset>0x0000005C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RESC_EXT</name>
              <description>External Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RESC_POR</name>
              <description>Power-On Reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RESC_BOR</name>
              <description>Brown-Out Reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RESC_SW</name>
              <description>Software Reset</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RESC_LDO</name>
              <description>LDO Reset</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCC</name>
          <description>Run-Mode Clock Configuration</description>
          <addressOffset>0x00000060</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCC_MOSCDIS</name>
              <description>Main Oscillator Disable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC_IOSCDIS</name>
              <description>Internal Oscillator Disable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC_MOSCVER</name>
              <description>Main Oscillator Verification Timer</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC_IOSCVER</name>
              <description>Internal Oscillator Verification Timer</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC_OSCSRC</name>
              <description>Oscillator Source</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_RCC_OSCSRC_MAIN</name>
                  <description>MOSC</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_OSCSRC_INT</name>
                  <description>IOSC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_OSCSRC_INT4</name>
                  <description>IOSC/4</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_RCC_XTAL</name>
              <description>Crystal Value</description>
              <bitRange>[9:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_1MHZ</name>
                  <description>1 MHz</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_1_84MHZ</name>
                  <description>1.8432 MHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_2MHZ</name>
                  <description>2 MHz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_2_45MHZ</name>
                  <description>2.4576 MHz</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_3_57MHZ</name>
                  <description>3.579545 MHz</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_3_68MHZ</name>
                  <description>3.6864 MHz</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_4MHZ</name>
                  <description>4 MHz</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_4_09MHZ</name>
                  <description>4.096 MHz</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_4_91MHZ</name>
                  <description>4.9152 MHz</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_5MHZ</name>
                  <description>5 MHz</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_5_12MHZ</name>
                  <description>5.12 MHz</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_6MHZ</name>
                  <description>6 MHz</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_6_14MHZ</name>
                  <description>6.144 MHz</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_7_37MHZ</name>
                  <description>7.3728 MHz</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_8MHZ</name>
                  <description>8 MHz</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_8_19MHZ</name>
                  <description>8.192 MHz</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_RCC_PLLVER</name>
              <description>PLL Verification</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC_BYPASS</name>
              <description>PLL Bypass</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC_OEN</name>
              <description>PLL Output Enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC_PWRDN</name>
              <description>PLL Power Down</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC_USESYSDIV</name>
              <description>Enable System Clock Divider</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC_SYSDIV</name>
              <description>System Clock Divisor</description>
              <bitRange>[26:23]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_RCC_SYSDIV_2</name>
                  <description>System clock /2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_SYSDIV_3</name>
                  <description>System clock /3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_SYSDIV_4</name>
                  <description>System clock /4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_SYSDIV_5</name>
                  <description>System clock /5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_SYSDIV_6</name>
                  <description>System clock /6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_SYSDIV_7</name>
                  <description>System clock /7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_SYSDIV_8</name>
                  <description>System clock /8</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_SYSDIV_9</name>
                  <description>System clock /9</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_SYSDIV_10</name>
                  <description>System clock /10</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_SYSDIV_11</name>
                  <description>System clock /11</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_SYSDIV_12</name>
                  <description>System clock /12</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_SYSDIV_13</name>
                  <description>System clock /13</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_SYSDIV_14</name>
                  <description>System clock /14</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_SYSDIV_15</name>
                  <description>System clock /15</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_SYSDIV_16</name>
                  <description>System clock /16</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_RCC_ACG</name>
              <description>Auto Clock Gating</description>
              <bitRange>[27:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLCFG</name>
          <description>XTAL to PLL Translation</description>
          <addressOffset>0x00000064</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PLLCFG_R</name>
              <description>PLL R Value</description>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PLLCFG_F</name>
              <description>PLL F Value</description>
              <bitRange>[13:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PLLCFG_OD</name>
              <description>PLL OD Value</description>
              <bitRange>[15:14]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_PLLCFG_OD_1</name>
                  <description>Divide by 1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_PLLCFG_OD_2</name>
                  <description>Divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_PLLCFG_OD_4</name>
                  <description>Divide by 4</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGC0</name>
          <description>Run Mode Clock Gating Control Register 0</description>
          <addressOffset>0x00000100</addressOffset>
        </register>
        <register>
          <name>RCGC1</name>
          <description>Run Mode Clock Gating Control Register 1</description>
          <addressOffset>0x00000104</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGC1_UART0</name>
              <description>UART0 Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_SSI0</name>
              <description>SSI0 Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_I2C0</name>
              <description>I2C0 Clock Gating Control</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_TIMER0</name>
              <description>Timer 0 Clock Gating Control</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_TIMER1</name>
              <description>Timer 1 Clock Gating Control</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC1_COMP0</name>
              <description>Analog Comparator 0 Clock Gating</description>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGC2</name>
          <description>Run Mode Clock Gating Control Register 2</description>
          <addressOffset>0x00000108</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGC2_GPIOA</name>
              <description>Port A Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC2_GPIOB</name>
              <description>Port B Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC2_GPIOC</name>
              <description>Port C Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGC0</name>
          <description>Sleep Mode Clock Gating Control Register 0</description>
          <addressOffset>0x00000110</addressOffset>
        </register>
        <register>
          <name>SCGC1</name>
          <description>Sleep Mode Clock Gating Control Register 1</description>
          <addressOffset>0x00000114</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGC1_UART0</name>
              <description>UART0 Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_SSI0</name>
              <description>SSI0 Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_I2C0</name>
              <description>I2C0 Clock Gating Control</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_TIMER0</name>
              <description>Timer 0 Clock Gating Control</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_TIMER1</name>
              <description>Timer 1 Clock Gating Control</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC1_COMP0</name>
              <description>Analog Comparator 0 Clock Gating</description>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGC2</name>
          <description>Sleep Mode Clock Gating Control Register 2</description>
          <addressOffset>0x00000118</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGC2_GPIOA</name>
              <description>Port A Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC2_GPIOB</name>
              <description>Port B Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGC2_GPIOC</name>
              <description>Port C Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGC0</name>
          <description>Deep Sleep Mode Clock Gating Control Register 0</description>
          <addressOffset>0x00000120</addressOffset>
        </register>
        <register>
          <name>DCGC1</name>
          <description>Deep-Sleep Mode Clock Gating Control Register 1</description>
          <addressOffset>0x00000124</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGC1_UART0</name>
              <description>UART0 Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_SSI0</name>
              <description>SSI0 Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_I2C0</name>
              <description>I2C0 Clock Gating Control</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_TIMER0</name>
              <description>Timer 0 Clock Gating Control</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_TIMER1</name>
              <description>Timer 1 Clock Gating Control</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC1_COMP0</name>
              <description>Analog Comparator 0 Clock Gating</description>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGC2</name>
          <description>Deep Sleep Mode Clock Gating Control Register 2</description>
          <addressOffset>0x00000128</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGC2_GPIOA</name>
              <description>Port A Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC2_GPIOB</name>
              <description>Port B Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGC2_GPIOC</name>
              <description>Port C Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DSLPCLKCFG</name>
          <description>Deep Sleep Clock Configuration</description>
          <addressOffset>0x00000144</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DSLPCLKCFG_IOSC</name>
              <description>IOSC Clock Source</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKVCLR</name>
          <description>Clock Verification Clear</description>
          <addressOffset>0x00000150</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_CLKVCLR_VERCLR</name>
              <description>Clock Verification Clear</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LDOARST</name>
          <description>Allow Unregulated LDO to Reset the Part</description>
          <addressOffset>0x00000160</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_LDOARST_LDOARST</name>
              <description>LDO Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
