lkolbly/cmsis-svd/data/TexasInstruments/LM3S102.svd
        <register>
          <name>PEND0</name>
          <description>Interrupt 0-31 Set Pending</description>
          <addressOffset>0x00000200</addressOffset>
          <fields>
            <field>
              <name>NVIC_PEND0_INT</name>
              <description>Interrupt Set Pending</description>
              <bitRange>[29:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT0</name>
                  <description>Interrupt 0 pend</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT1</name>
                  <description>Interrupt 1 pend</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT2</name>
                  <description>Interrupt 2 pend</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT3</name>
                  <description>Interrupt 3 pend</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT4</name>
                  <description>Interrupt 4 pend</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT5</name>
                  <description>Interrupt 5 pend</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT6</name>
                  <description>Interrupt 6 pend</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT7</name>
                  <description>Interrupt 7 pend</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT8</name>
                  <description>Interrupt 8 pend</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT9</name>
                  <description>Interrupt 9 pend</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT10</name>
                  <description>Interrupt 10 pend</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT11</name>
                  <description>Interrupt 11 pend</description>
                  <value>0x800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT12</name>
                  <description>Interrupt 12 pend</description>
                  <value>0x1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT13</name>
                  <description>Interrupt 13 pend</description>
                  <value>0x2000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT14</name>
                  <description>Interrupt 14 pend</description>
                  <value>0x4000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT15</name>
                  <description>Interrupt 15 pend</description>
                  <value>0x8000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT16</name>
                  <description>Interrupt 16 pend</description>
                  <value>0x10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT17</name>
                  <description>Interrupt 17 pend</description>
                  <value>0x20000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT18</name>
                  <description>Interrupt 18 pend</description>
                  <value>0x40000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT19</name>
                  <description>Interrupt 19 pend</description>
                  <value>0x80000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT20</name>
                  <description>Interrupt 20 pend</description>
                  <value>0x100000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT21</name>
                  <description>Interrupt 21 pend</description>
                  <value>0x200000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT22</name>
                  <description>Interrupt 22 pend</description>
                  <value>0x400000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT23</name>
                  <description>Interrupt 23 pend</description>
                  <value>0x800000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT24</name>
                  <description>Interrupt 24 pend</description>
                  <value>0x1000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT25</name>
                  <description>Interrupt 25 pend</description>
                  <value>0x2000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT26</name>
                  <description>Interrupt 26 pend</description>
                  <value>0x4000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT27</name>
                  <description>Interrupt 27 pend</description>
                  <value>0x8000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT28</name>
                  <description>Interrupt 28 pend</description>
                  <value>0x10000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_PEND0_INT29</name>
                  <description>Interrupt 29 pend</description>
                  <value>0x20000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UNPEND0</name>
          <description>Interrupt 0-31 Clear Pending</description>
          <addressOffset>0x00000280</addressOffset>
          <fields>
            <field>
              <name>NVIC_UNPEND0_INT</name>
              <description>Interrupt Clear Pending</description>
              <bitRange>[29:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT0</name>
                  <description>Interrupt 0 unpend</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT1</name>
                  <description>Interrupt 1 unpend</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT2</name>
                  <description>Interrupt 2 unpend</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT3</name>
                  <description>Interrupt 3 unpend</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT4</name>
                  <description>Interrupt 4 unpend</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT5</name>
                  <description>Interrupt 5 unpend</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT6</name>
                  <description>Interrupt 6 unpend</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT7</name>
                  <description>Interrupt 7 unpend</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT8</name>
                  <description>Interrupt 8 unpend</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT9</name>
                  <description>Interrupt 9 unpend</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT10</name>
                  <description>Interrupt 10 unpend</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT11</name>
                  <description>Interrupt 11 unpend</description>
                  <value>0x800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT12</name>
                  <description>Interrupt 12 unpend</description>
                  <value>0x1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT13</name>
                  <description>Interrupt 13 unpend</description>
                  <value>0x2000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT14</name>
                  <description>Interrupt 14 unpend</description>
                  <value>0x4000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT15</name>
                  <description>Interrupt 15 unpend</description>
                  <value>0x8000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT16</name>
                  <description>Interrupt 16 unpend</description>
                  <value>0x10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT17</name>
                  <description>Interrupt 17 unpend</description>
                  <value>0x20000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT18</name>
                  <description>Interrupt 18 unpend</description>
                  <value>0x40000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT19</name>
                  <description>Interrupt 19 unpend</description>
                  <value>0x80000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT20</name>
                  <description>Interrupt 20 unpend</description>
                  <value>0x100000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT21</name>
                  <description>Interrupt 21 unpend</description>
                  <value>0x200000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT22</name>
                  <description>Interrupt 22 unpend</description>
                  <value>0x400000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT23</name>
                  <description>Interrupt 23 unpend</description>
                  <value>0x800000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT24</name>
                  <description>Interrupt 24 unpend</description>
                  <value>0x1000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT25</name>
                  <description>Interrupt 25 unpend</description>
                  <value>0x2000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT26</name>
                  <description>Interrupt 26 unpend</description>
                  <value>0x4000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT27</name>
                  <description>Interrupt 27 unpend</description>
                  <value>0x8000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT28</name>
                  <description>Interrupt 28 unpend</description>
                  <value>0x10000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_UNPEND0_INT29</name>
                  <description>Interrupt 29 unpend</description>
                  <value>0x20000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ACTIVE0</name>
          <description>Interrupt 0-31 Active Bit</description>
          <addressOffset>0x00000300</addressOffset>
          <fields>
            <field>
              <name>NVIC_ACTIVE0_INT</name>
              <description>Interrupt Active</description>
              <bitRange>[29:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT0</name>
                  <description>Interrupt 0 active</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT1</name>
                  <description>Interrupt 1 active</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT2</name>
                  <description>Interrupt 2 active</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT3</name>
                  <description>Interrupt 3 active</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT4</name>
                  <description>Interrupt 4 active</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT5</name>
                  <description>Interrupt 5 active</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT6</name>
                  <description>Interrupt 6 active</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT7</name>
                  <description>Interrupt 7 active</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT8</name>
                  <description>Interrupt 8 active</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT9</name>
                  <description>Interrupt 9 active</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT10</name>
                  <description>Interrupt 10 active</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT11</name>
                  <description>Interrupt 11 active</description>
                  <value>0x800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT12</name>
                  <description>Interrupt 12 active</description>
                  <value>0x1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT13</name>
                  <description>Interrupt 13 active</description>
                  <value>0x2000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT14</name>
                  <description>Interrupt 14 active</description>
                  <value>0x4000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT15</name>
                  <description>Interrupt 15 active</description>
                  <value>0x8000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT16</name>
                  <description>Interrupt 16 active</description>
                  <value>0x10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT17</name>
                  <description>Interrupt 17 active</description>
                  <value>0x20000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT18</name>
                  <description>Interrupt 18 active</description>
                  <value>0x40000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT19</name>
                  <description>Interrupt 19 active</description>
                  <value>0x80000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT20</name>
                  <description>Interrupt 20 active</description>
                  <value>0x100000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT21</name>
                  <description>Interrupt 21 active</description>
                  <value>0x200000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT22</name>
                  <description>Interrupt 22 active</description>
                  <value>0x400000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT23</name>
                  <description>Interrupt 23 active</description>
                  <value>0x800000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT24</name>
                  <description>Interrupt 24 active</description>
                  <value>0x1000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT25</name>
                  <description>Interrupt 25 active</description>
                  <value>0x2000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT26</name>
                  <description>Interrupt 26 active</description>
                  <value>0x4000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT27</name>
                  <description>Interrupt 27 active</description>
                  <value>0x8000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT28</name>
                  <description>Interrupt 28 active</description>
                  <value>0x10000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_ACTIVE0_INT29</name>
                  <description>Interrupt 29 active</description>
                  <value>0x20000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI0</name>
          <description>Interrupt 0-3 Priority</description>
          <addressOffset>0x00000400</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI0_INT0</name>
              <description>Interrupt 0 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI0_INT1</name>
              <description>Interrupt 1 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI0_INT2</name>
              <description>Interrupt 2 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI0_INT3</name>
              <description>Interrupt 3 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI1</name>
          <description>Interrupt 4-7 Priority</description>
          <addressOffset>0x00000404</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI1_INT4</name>
              <description>Interrupt 4 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI1_INT5</name>
              <description>Interrupt 5 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI1_INT6</name>
              <description>Interrupt 6 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI1_INT7</name>
              <description>Interrupt 7 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
